In [1]:
import pandas as pd

In [4]:

dict1 = {
    'Name':['Lanre','Biola','Shola','Seun','Femi','Lola','Chidi'],
    'Marks':[98,89,99,87,90,83,99],
    'Gender':['Male','Female','Male','Male','Male','Female','Male']
}

df1 = pd.DataFrame(dict1)
df1

    Name  Marks  Gender
0  Lanre     98    Male
1  Biola     89  Female
2  Shola     99    Male
3   Seun     87    Male
4   Femi     90    Male
5   Lola     83  Female
6  Chidi     99    Male

### 1. Display 3 row from the dataframe

In [5]:
df1.head(3)

    Name  Marks  Gender
0  Lanre     98    Male
1  Biola     89  Female
2  Shola     99    Male

### 2. Check the last 3 rows of the dataframe

In [6]:
df1.tail(3)

    Name  Marks  Gender
4   Femi     90    Male
5   Lola     83  Female
6  Chidi     99    Male

### 3.Find the shape of the dataframe

In [10]:
df1.shape

(7, 3)

In [11]:
print('Numbers of rows:',df1.shape[0])
print('Numbers of columns:', df1.shape[1])

Numbers of rows: 7
Numbers of columns: 3

### 4. Get info about the total number of rows,columns,datatypes,memory requirement

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### 5.To check non-value in the dataset

In [21]:
# note: when you put axis=0 or axis=1 as argument in the sum method, 
# it gives the numbers of null values in the rows or columns

df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

### 6. Get Overall statistics about the dataframes

In [23]:
df1.describe(include='all')

         Name      Marks Gender
count       7   7.000000      7
unique      7        NaN      2
top     Lanre        NaN   Male
freq        1        NaN      5
mean      NaN  92.142857    NaN
std       NaN   6.491753    NaN
min       NaN  83.000000    NaN
25%       NaN  88.000000    NaN
50%       NaN  90.000000    NaN
75%       NaN  98.500000    NaN
max       NaN  99.000000    NaN

### 7. Find unique values from Gendar column

In [28]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

### 8.Find number of unique values from Gendar column

In [32]:
num_of_unique_value = df1['Gender'].nunique()
print('The number of unique value(s) is/are: ',num_of_unique_value)

The number of unique value(s) is/are:  2

### 9. Count the number of unique value in gendet column

In [34]:
df1['Gender'].value_counts()

Male      5
Female    2
Name: Gender, dtype: int64

### 10.Find the total number of students btw 90 amd 100

In [51]:
#sdt_above_90 = len(df1[df1['Marks'] >= 90])
sdt_above_90 = sum(df1['Marks'].between(90,100))

print(f"There are {sdt_above_90} students with marks with 90 and above")

There are 4 students with marks with 90 and above

### 11.Find average marks

In [52]:
 df1['Marks'].mean()

92.14285714285714

### 12a.Using apply method

In [54]:
def marks(x):
    return x/2

In [55]:
df1['Half_marks'] = df1['Marks'].apply(marks)

In [56]:
df1

    Name  Marks  Gender  Half_marks
0  Lanre     98    Male        49.0
1  Biola     89  Female        44.5
2  Shola     99    Male        49.5
3   Seun     87    Male        43.5
4   Femi     90    Male        45.0
5   Lola     83  Female        41.5
6  Chidi     99    Male        49.5

### 12b. Using lambda method

In [58]:
df1['Marks'].apply(lambda x: x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [59]:
df1

    Name  Marks  Gender  Half_marks
0  Lanre     98    Male        49.0
1  Biola     89  Female        44.5
2  Shola     99    Male        49.5
3   Seun     87    Male        43.5
4   Femi     90    Male        45.0
5   Lola     83  Female        41.5
6  Chidi     99    Male        49.5

### 13. To find length of the string in Name column

In [60]:
df1['Name'].apply(len)

0    5
1    5
2    5
3    4
4    4
5    4
6    5
Name: Name, dtype: int64

### 14. Using map function

In [64]:
# creating a gender code using map function
df1['gender_code'] = df1['Gender'].map({'Male':1,'Female':0})

In [65]:
df1

    Name  Marks  Gender  Half_marks  gender_code
0  Lanre     98    Male        49.0            1
1  Biola     89  Female        44.5            0
2  Shola     99    Male        49.5            1
3   Seun     87    Male        43.5            1
4   Femi     90    Male        45.0            1
5   Lola     83  Female        41.5            0
6  Chidi     99    Male        49.5            1

### 15. Drop columns

In [69]:
# Note: when dropping multiple list,put the columns in a list
df1.drop('gender_code', axis=1)

    Name  Marks  Gender  Half_marks
0  Lanre     98    Male        49.0
1  Biola     89  Female        44.5
2  Shola     99    Male        49.5
3   Seun     87    Male        43.5
4   Femi     90    Male        45.0
5   Lola     83  Female        41.5
6  Chidi     99    Male        49.5

### 16. To modify existing dataframe

In [72]:
df1.drop(['Half_marks','gender_code'],axis=1,inplace=True)

In [73]:
df1

    Name  Marks  Gender
0  Lanre     98    Male
1  Biola     89  Female
2  Shola     99    Male
3   Seun     87    Male
4   Femi     90    Male
5   Lola     83  Female
6  Chidi     99    Male

### 17. Print names of columns

In [74]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

### 18. Sort the Marks columns

In [77]:
df1.sort_values(by='Marks',ascending=False)

    Name  Marks  Gender
2  Shola     99    Male
6  Chidi     99    Male
0  Lanre     98    Male
4   Femi     90    Male
1  Biola     89  Female
3   Seun     87    Male
5   Lola     83  Female

### 19. Display names and marks of female student only

In [86]:
#df1[df1['Gender'] == 'Female'][['Name','Marks']]
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

    Name  Marks
1  Biola     89
5   Lola     83